Revit 2027 API
StairsType.MiddleSupportsNumber Property
 The number of middle supports used in the stair.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int MiddleSupportsNumber { get; set; }
Public Property MiddleSupportsNumber As Integer
	Get
	Set
public:
property int MiddleSupportsNumber {
	int get ();
	void set (int value);
}
member MiddleSupportsNumber : int with get, set
Property Value
Int32
 0 if the stairs type has no middle support.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for supportsNumber is negative.
InvalidOperationException |  When setting this property: The stairs type has no middle support so the data being set is not applicable.
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace